PX4/PX4-Autopilot/nuttx/arch/arm/src/lm3s/lm3s_vectors.S
/************************************************************************************
 * arch/arm/src/lm3s/lm3s_vectors.S
 * arch/arm/src/chip/lm3s_vectors.S
 *
 *   Copyright (C) 2009-2010 Gregory Nutt. All rights reserved.
 *   Author: Gregory Nutt <spudmonkey@racsa.co.cr>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ************************************************************************************/

/************************************************************************************
 * Included Files
 ************************************************************************************/

#include <nuttx/config.h>
#include <arch/irq.h>

/************************************************************************************
 * Preprocessor Definitions
 ************************************************************************************/

/* Memory Map:
 *
 * 0x0000:0000 - Beginning of FLASH. Address of vectors (if not using bootloader)
 * 0x0002:0000 - Address of vectors if using bootloader
 * 0x0003:ffff - End of flash
 * 0x2000:0000 - Start of SRAM and start of .data (_sdata)
 *             - End of .data (_edata) abd start of .bss (_sbss)
 *             - End of .bss (_ebss) and bottom of idle stack
 *             - _ebss + CONFIG_IDLETHREAD_STACKSIZE = end of idle stack, start of heap
 * 0x2000:ffff - End of SRAM and end of heap
 */

#define IDLE_STACK		(_ebss+CONFIG_IDLETHREAD_STACKSIZE-4)
#define HEAP_BASE		(_ebss+CONFIG_IDLETHREAD_STACKSIZE-4)

/* The Cortex-M3 return from interrupt is unusual.  We provide the following special
 * address to the BX instruction.  The particular value also forces a return to
 * thread mode and covers state from the main stack point, the MSP (vs. the MSP).
 */

#define EXC_RETURN		0xfffffff9

/************************************************************************************
 * Global Symbols
 ************************************************************************************/

	.globl		__start

	.syntax		unified
	.thumb
	.file		"lm3s_vectors.S"

/************************************************************************************
 * Macros
 ************************************************************************************/

/* On entry into an IRQ, the hardware automatically saves the xPSR, PC, LR, R12, R0-R3
 * registers on the stack, then branches to an instantantiation of the following
 * macro.  This macro simply loads the IRQ number into R0, then jumps to the common
 * IRQ handling logic.
 */

	.macro	HANDLER, label, irqno
	.thumb_func
\label:
	mov		r0, #\irqno
	b		lm3s_irqcommon
	.endm

/************************************************************************************
 * Vectors
 ************************************************************************************/

	.section	.vectors, "ax"
	.code		16
	.align		2
	.globl		lm3s_vectors
	.type		lm3s_vectors, function

lm3s_vectors:

/* Processor Exceptions */

	.word	IDLE_STACK			/* Vector  0: Reset stack pointer */
	.word	__start				/* Vector  1: Reset vector */
	.word	lm3s_nmi			/* Vector  2: Non-Maskable Interrupt (NMI) */
	.word	lm3s_hardfault		/* Vector  3: Hard fault */
	.word	lm3s_mpu			/* Vector  4: Memory management (MPU) */
	.word	lm3s_busfault		/* Vector  5: Bus fault */
	.word	lm3s_usagefault		/* Vector  6: Usage fault */
	.word	lm3s_reserved		/* Vector  7: Reserved */
	.word	lm3s_reserved		/* Vector  8: Reserved */
	.word	lm3s_reserved		/* Vector  9: Reserved */
	.word	lm3s_reserved		/* Vector 10: Reserved */
	.word	lm3s_svcall			/* Vector 11: SVC call */
	.word	lm3s_dbgmonitor		/* Vector 12: Debug monitor */
	.word	lm3s_reserved		/* Vector 13: Reserved */
	.word	lm3s_pendsv			/* Vector 14: Pendable system service request */
	.word	lm3s_systick		/* Vector 15: System tick */

/* External Interrupts */

#if defined(CONFIG_ARCH_CHIP_LM3S6918)
	.word	lm3s_gpioa			/* Vector 16: GPIO Port A */
	.word	lm3s_gpiob			/* Vector 17: GPIO Port B */
	.word	lm3s_gpioc			/* Vector 18: GPIO Port C */
	.word	lm3s_gpiod			/* Vector 19: GPIO Port D */
	.word	lm3s_gpioe			/* Vector 20: GPIO Port E */
	.word	lm3s_uart0			/* Vector 21: UART 0 */
	.word	lm3s_uart1			/* Vector 22: UART 1 */
	.word	lm3s_ssi0			/* Vector 23: SSI 0 */
	.word	lm3s_i2c0			/* Vector 24: I2C 0 */
	.word	lm3s_reserved		/* Vector 25: Reserved */
	.word	lm3s_reserved		/* Vector 26: Reserved */
	.word	lm3s_reserved		/* Vector 27: Reserved */
	.word	lm3s_reserved		/* Vector 28: Reserved */
	.word	lm3s_reserved		/* Vector 29: Reserved */
	.word	lm3s_adc0			/* Vector 30: ADC Sequence 0 */
	.word	lm3s_adc1			/* Vector 31: ADC Sequence 1 */
	.word	lm3s_adc2			/* Vector 32: ADC Sequence 2 */
	.word	lm3s_adc3			/* Vector 33: ADC Sequence 3 */
	.word	lm3s_wdog			/* Vector 34: Watchdog Timer */
	.word	lm3s_tmr0a			/* Vector 35: Timer 0 A */
	.word	lm3s_tmr0b			/* Vector 36: Timer 0 B */
	.word	lm3s_tmr1a			/* Vector 37: Timer 1 A */
	.word	lm3s_tmr1b			/* Vector 38: Timer 1 B */
	.word	lm3s_tmr2a			/* Vector 39: Timer 2 A */
	.word	lm3s_tmr2b			/* Vector 40: Timer 3 B */
	.word	lm3s_cmp0			/* Vector 41: Analog Comparator 0 */
	.word	lm3s_cmp1			/* Vector 42: Analog Comparator 1 */
	.word	lm3s_reserved		/* Vector 43: Reserved */
	.word	lm3s_syscon			/* Vector 44: System Control */
	.word	lm3s_flashcon		/* Vector 45: FLASH Control */
	.word	lm3s_gpiof			/* Vector 46: GPIO Port F */
	.word	lm3s_gpiog			/* Vector 47: GPIO Port G */
	.word	lm3s_gpioh			/* Vector 48: GPIO Port H */
	.word	lm3s_reserved		/* Vector 49: Reserved */
	.word	lm3s_ssi1			/* Vector 50: SSI 1 */
	.word	lm3s_tmr3a			/* Vector 51: Timer 3 A */
	.word	lm3s_tmr3b			/* Vector 52: Timer 3 B */
	.word	lm3s_i2c1			/* Vector 53: I2C 1 */
	.word	lm3s_reserved		/* Vector 54: Reserved */
	.word	lm3s_reserved		/* Vector 55: Reserved */
	.word	lm3s_reserved		/* Vector 56: Reserved */
	.word	lm3s_reserved		/* Vector 57: Reserved */
 	.word	lm3s_eth			/* Vector 58: Ethernet Controller */
	.word	lm3s_hib			/* Vector 59: Hibernation Module */
	.word	lm3s_reserved		/* Vector 60: Reserved */
	.word	lm3s_reserved		/* Vector 61: Reserved */
	.word	lm3s_reserved		/* Vector 62: Reserved */
	.word	lm3s_reserved		/* Vector 63: Reserved */
	.word	lm3s_reserved		/* Vector 64: Reserved */
	.word	lm3s_reserved		/* Vector 65: Reserved */
	.word	lm3s_reserved		/* Vector 66: Reserved */
	.word	lm3s_reserved		/* Vector 67: Reserved */
	.word	lm3s_reserved		/* Vector 68: Reserved */
	.word	lm3s_reserved		/* Vector 69: Reserved */
	.word	lm3s_reserved		/* Vector 70: Reserved */
#elif defined(CONFIG_ARCH_CHIP_LM3S6965)
	.word	lm3s_gpioa			/* Vector 16: GPIO Port A */
	.word	lm3s_gpiob			/* Vector 17: GPIO Port B */
	.word	lm3s_gpioc			/* Vector 18: GPIO Port C */
	.word	lm3s_gpiod			/* Vector 19: GPIO Port D */
	.word	lm3s_gpioe			/* Vector 20: GPIO Port E */
	.word	lm3s_uart0			/* Vector 21: UART 0 */
	.word	lm3s_uart1			/* Vector 22: UART 1 */
	.word	lm3s_ssi0			/* Vector 23: SSI 0 */
	.word	lm3s_i2c0			/* Vector 24: I2C 0 */
	.word	lm3s_pwmfault		/* Vector 25: PWM Fault */
	.word	lm3s_pwm0			/* Vector 26: PWM Generator 0 */
	.word	lm3s_pwm1			/* Vector 27: PWM Generator 1 */
	.word	lm3s_pwm2			/* Vector 28: PWM Generator 2 */
	.word	lm3s_qei0			/* Vector 29: QEI0 */
	.word	lm3s_adc0			/* Vector 30: ADC Sequence 0 */
	.word	lm3s_adc1			/* Vector 31: ADC Sequence 1 */
	.word	lm3s_adc2			/* Vector 32: ADC Sequence 2 */
	.word	lm3s_adc3			/* Vector 33: ADC Sequence 3 */
	.word	lm3s_wdog			/* Vector 34: Watchdog Timer */
	.word	lm3s_tmr0a			/* Vector 35: Timer 0 A */
	.word	lm3s_tmr0b			/* Vector 36: Timer 0 B */
	.word	lm3s_tmr1a			/* Vector 37: Timer 1 A */
	.word	lm3s_tmr1b			/* Vector 38: Timer 1 B */
	.word	lm3s_tmr2a			/* Vector 39: Timer 2 A */
	.word	lm3s_tmr2b			/* Vector 40: Timer 3 B */
	.word	lm3s_cmp0			/* Vector 41: Analog Comparator 0 */
	.word	lm3s_cmp1			/* Vector 42: Analog Comparator 1 */
	.word	lm3s_reserved		/* Vector 43: Reserved */
	.word	lm3s_syscon			/* Vector 44: System Control */
	.word	lm3s_flashcon		/* Vector 45: FLASH Control */
	.word	lm3s_gpiof			/* Vector 46: GPIO Port F */
	.word	lm3s_gpiog			/* Vector 47: GPIO Port G */
	.word	lm3s_reserved		/* Vector 48: Reserved */
	.word	lm3s_uart2			/* Vector 49: UART 2 */
	.word	lm3s_reserved		/* Vector 50: Reserved */
	.word	lm3s_tmr3a			/* Vector 51: Timer 3 A */
	.word	lm3s_tmr3b			/* Vector 52: Timer 3 B */
	.word	lm3s_i2c1			/* Vector 53: I2C 1 */
	.word	lm3s_qei1			/* Vector 54: QEI1 */
	.word	lm3s_reserved		/* Vector 55: Reserved */
	.word	lm3s_reserved		/* Vector 56: Reserved */
	.word	lm3s_reserved		/* Vector 57: Reserved */
 	.word	lm3s_eth			/* Vector 58: Ethernet Controller */
	.word	lm3s_hib			/* Vector 59: Hibernation Module */
	.word	lm3s_reserved		/* Vector 60: Reserved */
	.word	lm3s_reserved		/* Vector 61: Reserved */
	.word	lm3s_reserved		/* Vector 62: Reserved */
	.word	lm3s_reserved		/* Vector 63: Reserved */
	.word	lm3s_reserved		/* Vector 64: Reserved */
	.word	lm3s_reserved		/* Vector 65: Reserved */
	.word	lm3s_reserved		/* Vector 66: Reserved */
	.word	lm3s_reserved		/* Vector 67: Reserved */
	.word	lm3s_reserved		/* Vector 68: Reserved */
	.word	lm3s_reserved		/* Vector 69: Reserved */
	.word	lm3s_reserved		/* Vector 70: Reserved */
#elif defined(CONFIG_ARCH_CHIP_LM3S9B96)
	.word	lm3s_gpioa			/* Vector 16: GPIO Port A */
	.word	lm3s_gpiob			/* Vector 17: GPIO Port B */
	.word	lm3s_gpioc			/* Vector 18: GPIO Port C */
	.word	lm3s_gpiod			/* Vector 19: GPIO Port D */
	.word	lm3s_gpioe			/* Vector 20: GPIO Port E */
	.word	lm3s_uart0			/* Vector 21: UART 0 */
	.word	lm3s_uart1			/* Vector 22: UART 1 */
	.word	lm3s_ssi0			/* Vector 23: SSI 0 */
	.word	lm3s_i2c0			/* Vector 24: I2C 0 */
	.word	lm3s_pwmfault		/* Vector 25: PWM Fault */
	.word	lm3s_pwm0			/* Vector 26: PWM Generator 0 */
	.word	lm3s_pwm1			/* Vector 27: PWM Generator 1 */
	.word	lm3s_pwm2			/* Vector 28: PWM Generator 2 */
	.word	lm3s_qei0			/* Vector 29: QEI0 */
	.word	lm3s_adc0			/* Vector 30: ADC Sequence 0 */
	.word	lm3s_adc1			/* Vector 31: ADC Sequence 1 */
	.word	lm3s_adc2			/* Vector 32: ADC Sequence 2 */
	.word	lm3s_adc3			/* Vector 33: ADC Sequence 3 */
	.word	lm3s_wdog			/* Vector 34: Watchdog Timer */
	.word	lm3s_tmr0a			/* Vector 35: Timer 0 A */
	.word	lm3s_tmr0b			/* Vector 36: Timer 0 B */
	.word	lm3s_tmr1a			/* Vector 37: Timer 1 A */
	.word	lm3s_tmr1b			/* Vector 38: Timer 1 B */
	.word	lm3s_tmr2a			/* Vector 39: Timer 2 A */
	.word	lm3s_tmr2b			/* Vector 40: Timer 3 B */
	.word	lm3s_cmp0			/* Vector 41: Analog Comparator 0 */
	.word	lm3s_cmp1			/* Vector 42: Analog Comparator 1 */
	.word	lm3s_cmp2			/* Vector 43: Reserved */
	.word	lm3s_syscon			/* Vector 44: System Control */
	.word	lm3s_flashcon		/* Vector 45: FLASH Control */
	.word	lm3s_gpiof			/* Vector 46: GPIO Port F */
	.word	lm3s_gpiog			/* Vector 47: GPIO Port G */
	.word	lm3s_gpioh			/* Vector 48: GPIO Port H */
	.word	lm3s_uart2			/* Vector 49: UART 2 */
	.word	lm3s_ssi1			/* Vector 50: SSI 1 */
	.word	lm3s_tmr3a			/* Vector 51: Timer 3 A */
	.word	lm3s_tmr3b			/* Vector 52: Timer 3 B */
	.word	lm3s_i2c1			/* Vector 53: I2C 1 */
	.word	lm3s_qei1			/* Vector 54: QEI1 */
	.word	lm3s_can0			/* Vector 55: CAN 0 */
	.word	lm3s_can1			/* Vector 56: CAN 1 */
	.word	lm3s_reserved		/* Vector 57: Reserved */
 	.word	lm3s_eth			/* Vector 58: Ethernet Controller */
	.word	lm3s_reserved		/* Vector 59: Reserved */
	.word	lm3s_usb			/* Vector 60: USB */
	.word	lm3s_pwm3			/* Vector 61: PWM 3 */
	.word	lm3s_udmasoft		/* Vector 62: uDMA Software */
	.word	lm3s_udmaerror		/* Vector 63: uDMA Error */
	.word	lm3s_adc1_0			/* Vector 64: ADC1 Sequence 0 */
	.word	lm3s_adc1_1			/* Vector 65: ADC1 Sequence 1 */
	.word	lm3s_adc1_2			/* Vector 66: ADC1 Sequence 2 */
	.word	lm3s_adc1_3			/* Vector 67: ADC1 Sequence 3 */
	.word	lm3s_i2s0 			/* Vector 68: I2S 0 */
	.word	lm3s_epi			/* Vector 69: Reserved */
	.word	lm3s_gpioj			/* Vector 70: GPIO J */
	.word	lm3s_reserved		/* Vector 71: Reserved */
	#elif defined(CONFIG_ARCH_CHIP_LM3S8962)
	.word	lm3s_gpioa			/* Vector 16: GPIO Port A */
	.word	lm3s_gpiob			/* Vector 17: GPIO Port B */
	.word	lm3s_gpioc			/* Vector 18: GPIO Port C */
	.word	lm3s_gpiod			/* Vector 19: GPIO Port D */
	.word	lm3s_gpioe			/* Vector 20: GPIO Port E */
	.word	lm3s_uart0			/* Vector 21: UART 0 */
	.word	lm3s_uart1			/* Vector 22: UART 1 */
	.word	lm3s_ssi0			/* Vector 23: SSI 0 */
	.word	lm3s_i2c0			/* Vector 24: I2C 0 */
	.word	lm3s_pwmfault		/* Vector 25: PWM Fault */
	.word	lm3s_pwm0			/* Vector 26: PWM Generator 0 */
	.word	lm3s_pwm1			/* Vector 27: PWM Generator 1 */
	.word	lm3s_pwm2			/* Vector 28: PWM Generator 2 */
	.word	lm3s_qei0			/* Vector 29: QEI0 */
	.word	lm3s_adc0			/* Vector 30: ADC Sequence 0 */
	.word	lm3s_adc1			/* Vector 31: ADC Sequence 1 */
	.word	lm3s_adc2			/* Vector 32: ADC Sequence 2 */
	.word	lm3s_adc3			/* Vector 33: ADC Sequence 3 */
	.word	lm3s_wdog			/* Vector 34: Watchdog Timer */
	.word	lm3s_tmr0a			/* Vector 35: Timer 0 A */
	.word	lm3s_tmr0b			/* Vector 36: Timer 0 B */
	.word	lm3s_tmr1a			/* Vector 37: Timer 1 A */
	.word	lm3s_tmr1b			/* Vector 38: Timer 1 B */
	.word	lm3s_tmr2a			/* Vector 39: Timer 2 A */
	.word	lm3s_tmr2b			/* Vector 40: Timer 3 B */
	.word	lm3s_cmp0			/* Vector 41: Analog Comparator 0 */
	.word	lm3s_reserved		/* Vector 42: Reserved */
	.word	lm3s_reserved		/* Vector 43: Reserved */
	.word	lm3s_syscon			/* Vector 44: System Control */
	.word	lm3s_flashcon		/* Vector 45: FLASH Control */
	.word	lm3s_gpiof			/* Vector 46: GPIO Port F */
	.word	lm3s_gpiog			/* Vector 47: GPIO Port G */
	.word	lm3s_reserved		/* Vector 48: Reserved */
	.word	lm3s_reserved		/* Vector 49: Reserved */
	.word	lm3s_reserved		/* Vector 50: Reserved */
	.word	lm3s_tmr3a			/* Vector 51: Timer 3 A */
	.word	lm3s_tmr3b			/* Vector 52: Timer 3 B */
	.word	lm3s_reserved		/* Vector 53: Reserved*/
	.word	lm3s_qei1			/* Vector 54: QEI1 */
	.word	lm3s_can0			/* Vector 55: Can Controller */
	.word	lm3s_reserved		/* Vector 56: Reserved */
	.word	lm3s_reserved		/* Vector 57: Reserved */
 	.word	lm3s_eth			/* Vector 58: Ethernet Controller */
	.word	lm3s_hib			/* Vector 59: Hibernation Module */
	.word	lm3s_reserved		/* Vector 60: Reserved */
	.word	lm3s_reserved		/* Vector 61: Reserved */
	.word	lm3s_reserved		/* Vector 62: Reserved */
	.word	lm3s_reserved		/* Vector 63: Reserved */
	.word	lm3s_reserved		/* Vector 64: Reserved */
	.word	lm3s_reserved		/* Vector 65: Reserved */
	.word	lm3s_reserved		/* Vector 66: Reserved */
	.word	lm3s_reserved		/* Vector 67: Reserved */
	.word	lm3s_reserved		/* Vector 68: Reserved */
	.word	lm3s_reserved		/* Vector 69: Reserved */
	.word	lm3s_reserved		/* Vector 70: Reserved */
#else
#  error "Vectors not specified for this LM3S chip"
#endif
	.size	lm3s_vectors, .-lm3s_vectors

/************************************************************************************
 * .text
 ************************************************************************************/

	.text
	.type	handlers, function
	.thumb_func
handlers:
	HANDLER	lm3s_reserved, LM3S_IRQ_RESERVED		/* Unexpected/reserved vector */
	HANDLER	lm3s_nmi, LM3S_IRQ_NMI					/* Vector  2: Non-Maskable Interrupt (NMI) */
	HANDLER	lm3s_hardfault, LM3S_IRQ_HARDFAULT		/* Vector  3: Hard fault */
	HANDLER	lm3s_mpu, LM3S_IRQ_MEMFAULT				/* Vector  4: Memory management (MPU) */
	HANDLER	lm3s_busfault, LM3S_IRQ_BUSFAULT		/* Vector  5: Bus fault */
	HANDLER	lm3s_usagefault, LM3S_IRQ_USAGEFAULT	/* Vector  6: Usage fault */
	HANDLER	lm3s_svcall, LM3S_IRQ_SVCALL			/* Vector 11: SVC call */
	HANDLER	lm3s_dbgmonitor, LM3S_IRQ_DBGMONITOR	/* Vector 12: Debug Monitor */
	HANDLER	lm3s_pendsv, LM3S_IRQ_PENDSV			/* Vector 14: Penable system service request */
	HANDLER	lm3s_systick, LM3S_IRQ_SYSTICK			/* Vector 15: System tick */

